Autodesk.Revit.DB.ACADExportOptions.HatchBackgroundColor
The color that will be set as hatch backgound color on the exported hatch.
This color will be used only if useHatchBackgroundColor is true.
default value is white
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ACADExportOptions.NonplotSuffix
If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot.
No action will be performed if the suffix is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.ACADExportOptions.LinetypesFileName
The custom linetype file name (*.lin).
Default value is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null